from util.flatten import flatten_map

COLUMN_MAP = {

    "품목명": [
        "품목명", "상품명", "제품명", "이름"
    ],

    "단가": [
        "단가", "가격", "금액", "가격대"
    ],

    "재고금액": [
        "재고금액", "총금액", "재고 가치"
    ],

    "재고수량": [
        "재고수량", "재고", "수량", "재고 수량"
    ],

    "안전재고": [
        "안전재고", "안전 재고"
    ],

    "입고일": [
        "입고일", "입고 날짜", "입고날", "입고 날"
    ],

    "최근출고일": [
        "최근출고일", "출고일", "최근 출고일"
    ],

    "공급업체": [
        "공급업체", "납품업체", "거래처"
    ],

    "창고": [
        "창고", "보관창고", "보관", "물류창고"
    ],

    "상태": [
        "상태"
    ]
}
ALL_COLUMN_KEYWORDS = flatten_map(COLUMN_MAP)
